app/controllers/clients_controller.rb

SELECT * FROM "clients"
---
  def index
    @clients = Client.all