app/controllers/products_controller.rb

SELECT * FROM "products"
---
  def index
    @products = Product.all

SELECT * FROM "products" WHERE ("products"."id" = 1)
---
  def show
    @product = Product.find( params[:id] )